In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("../clientes_loja.csv")

In [5]:
df.head() # Apresenta as 5 primeiras linhas

,cliente_id,nome,idade,cidade,estado,data_ultima_compra,valor_total_compras,frequencia_compras,assinante_vip
0,1,Ana Costa,28,São Paulo,SP,2025-04-15,1532.40,12,Sim
1,2,Carlos Silva,35,Rio de Janeiro,RJ,2025-04-10,932.00,5,Não
2,3,Beatriz Nunes,42,Belo Horizonte,MG,2025-03-29,2675.70,23,Sim
3,4,Daniel Souza,30,Curitiba,PR,2025-04-12,845.50,8,Não
4,5,Joana Lima,25,Porto Alegre,RS,2025-03-21,432.99,3,Não

### groupby
É uma forma de dividir os dados em grupos baseados em uma ou mais colunas, aplicar uma função agregadora (sum (), mean(), count()) e depois combinar os resultados

_df.groupby(by)[colunas].função()_

In [11]:
df.groupby("cidade")[["valor_total_compras"]].sum()

                valor_total_compras
cidade
Belo Horizonte              2675.70
Curitiba                     845.50
Florianópolis                245.00
Fortaleza                    721.30
Porto Alegre                 432.99
Recife                      1580.00
Rio de Janeiro               932.00
Salvador                    1299.90
São Luís                    3240.10
São Paulo                   1532.40

In [10]:
df.groupby("cidade")[["valor_total_compras", "assinante_vip"]].sum()

                valor_total_compras assinante_vip
cidade
Belo Horizonte              2675.70           Sim
Curitiba                     845.50           Não
Florianópolis                245.00           Não
Fortaleza                    721.30           Não
Porto Alegre                 432.99           Não
Recife                      1580.00           Sim
Rio de Janeiro               932.00           Não
Salvador                    1299.90           Sim
São Luís                    3240.10           Sim
São Paulo                   1532.40           Sim

        valor_total_compras assinante_vip
estado
BA                  1299.90           Sim
CE                   721.30           Não
MA                  3240.10           Sim
MG                  2675.70           Sim
PE                  1580.00           Sim
PR                   845.50           Não
RJ                   932.00           Não
RS                   432.99           Não
SC                   245.00           Não
SP                  1532.40           Sim